#+TITLE: May16_practice
** Complete the function below, to create a recursive function productDigits that takes in 1 parameter, a non-negative integer, n, and returns the product of n's digits. For example productDigits(232) will return 12 (2 x 3 x 2), and productDigits(13999019) will return 0.
#+BEGIN_SRC C
int productDigits(int number){
    //3 2450/10 2 2
    if(number<10){
        return number;
    }
    else{
       int dig= number%10;
       int product=dig*productDigits((number/10));
       return product;
    }

}
int main(void){
    int test=2453;
    printf("The result is %d",productDigits(test));
}
#+END_SRC

#+RESULTS:
: The result is 120
